{"contact": {"image": "/images/social-interaction.svg", "tips": [{"title": "Share contacts with trusted individuals", "description": "Only share your contacts with people you trust to maintain the privacy and security of the information."}, {"title": "Obtain consent before sharing", "description": "Seek permission from the contact owner before sharing their information with others."}, {"title": "Ensure contact accuracy", "description": "Double-check the contact details for accuracy before sharing to avoid passing on incorrect or outdated information."}, {"title": "Use a secure communication channel", "description": "When sharing contacts, use secure channels such as encrypted messaging apps or secure email to protect the information from unauthorized access."}, {"title": "Consider sharing limited information", "description": "If appropriate, share only the necessary contact details to minimize the exposure of sensitive information."}, {"title": "Set sharing permissions", "description": "If sharing contacts through a digital platform, utilize sharing settings to control who can view or edit the shared contacts."}, {"title": "Be mindful of data protection regulations", "description": "Familiarize yourself with relevant data protection laws and regulations in your jurisdiction to ensure compliance when sharing contacts."}, {"title": "Regularly review shared contacts", "description": "Periodically review the contacts you have shared to ensure they are still relevant and revoke access if necessary."}, {"title": "Educate recipients on data handling", "description": "Brief the recipients of shared contacts about the sensitivity of the information and emphasize the importance of handling it securely."}, {"title": "Consider encrypted sharing options", "description": "Explore using password-protected files, encrypted cloud storage, or secure password managers to share contacts while adding an extra layer of protection."}], "fields": {"basic": [{"name": "name"}, {"name": "phoneNumber", "label": "Phone Number"}], "additional": [{"name": "work"}, {"name": "email"}, {"name": "address"}, {"name": "website"}, {"as": "textarea", "name": "note", "rows": 5}]}}, "login": {"image": "/images/secure-login.svg", "tips": [{"title": "Use strong and unique passwords", "description": "Create a password that is at least 12 characters long and includes a mix of upper and lowercase letters, numbers, and special characters. Avoid using common or easily guessable passwords."}, {"title": "Avoid password reuse", "description": "Use a different password for each online account you have. If one account gets compromised, the others will still be secure."}, {"title": "Enable two-factor authentication (2FA)", "description": "Use an additional layer of security by enabling 2FA whenever possible. This typically involves entering a verification code sent to your phone or email in addition to your password."}, {"title": "Be cautious of phishing attempts", "description": "Be wary of suspicious emails, messages, or websites that ask for your login credentials. Verify the legitimacy of the source before providing any personal information."}, {"title": "Regularly update your passwords", "description": "Change your passwords periodically, especially for critical accounts. Aim to update them every 3-6 months."}, {"title": "Keep your devices updated", "description": "Install the latest updates for your operating system, apps, and antivirus software. These updates often include security patches that protect against known vulnerabilities."}, {"title": "Secure your Wi-Fi network", "description": "Set a strong password for your home Wi-Fi network to prevent unauthorized access. Avoid using default passwords provided by your internet service provider."}, {"title": "Practice safe browsing", "description": "Only enter login credentials on secure websites with an 'HTTPS' connection. Avoid using public Wi-Fi networks for confidential activities like logging into banking or email accounts."}, {"title": "Use unique email addresses", "description": "Consider creating separate email addresses for important accounts to reduce the risk of a single point of failure if one email is compromised."}, {"title": "Limit personal information sharing", "description": "Be cautious about sharing personal information online, especially on public forums or social media platforms. Identity thieves can use this information to impersonate you."}], "fields": {"basic": [{"name": "url"}, {"name": "email"}, {"name": "username"}, {"name": "phoneNumber", "label": "Phone Number"}, {"name": "password", "type": "password"}]}}, "paymentCard": {"image": "/images/credit-card-payments.svg", "tips": [{"title": "Keep your credit card secure", "description": "Protect your credit card from theft or unauthorized use by keeping it in a secure place and never sharing your card details with others."}, {"title": "Monitor your transactions regularly", "description": "Review your credit card statements frequently to identify any unauthorized charges or suspicious activity, and report them to your card issuer immediately."}, {"title": "Use secure payment methods", "description": "When making online payments, use secure platforms or payment gateways that encrypt your credit card information to prevent it from being intercepted by third parties."}, {"title": "Beware of phishing scams", "description": "Be cautious of emails, calls, or messages asking for your credit card details. Legitimate organizations will never request confidential information via unsolicited communications."}, {"title": "Create strong passwords", "description": "Choose strong, unique passwords for your online payment accounts, and avoid using easily guessable information such as birthdays or names."}, {"title": "Update your devices and software", "description": "Keep your computer, smartphone, and payment apps up to date with the latest security patches to minimize vulnerabilities that could be exploited by attackers."}, {"title": "Enable transaction notifications", "description": "Enable notifications for your credit card transactions to receive alerts whenever a transaction is made, helping you identify any suspicious or unauthorized activity promptly."}, {"title": "Avoid entering card details on public Wi-Fi", "description": "Refrain from making credit card payments or entering your card details when connected to public Wi-Fi networks, as they may be insecure and prone to interception."}, {"title": "Be cautious of card skimmers", "description": "Inspect card readers at ATMs or payment terminals for any signs of tampering, as criminals may attach skimming devices to steal your card information. If in doubt, use another machine."}, {"title": "Report lost or stolen cards immediately", "description": "If your credit card is lost, stolen, or compromised, contact your card issuer immediately to have it blocked and request a replacement card."}], "fields": {"basic": [{"name": "owner"}, {"name": "cardNumber", "label": "Card Number"}, {"name": "password", "type": "password"}, {"name": "cvv2", "type": "password"}, {"name": "expiration"}]}}, "wifiPassword": {"image": "/images/remotely.svg", "tips": [{"title": "Change the default SSID and password", "description": "Customize your Wi-Fi network name (SSID) and set a strong, unique password to prevent unauthorized access to your network."}, {"title": "Enable Wi-Fi network encryption", "description": "Use WPA2 or WPA3 encryption protocols to secure your Wi-Fi network and ensure that data transmitted between devices is encrypted and protected."}, {"title": "Regularly update your router's firmware", "description": "Keep your router's firmware up to date with the latest security patches and feature enhancements to protect against known vulnerabilities."}, {"title": "Disable remote management", "description": "Disable the option for remote management of your router, as it can be a potential entry point for attackers to manipulate or compromise your network."}, {"title": "Enable network firewall protections", "description": "Activate the built-in firewall on your router to filter incoming and outgoing network traffic, adding an extra layer of security to your Wi-Fi network."}, {"title": "Use a strong Wi-Fi password", "description": "Create a strong, complex password for your Wi-Fi network that includes a combination of uppercase and lowercase letters, numbers, and special characters."}, {"title": "Disable WPS (Wi-Fi Protected Setup)", "description": "Turn off WPS on your router, as it can be susceptible to brute-force attacks and compromise the security of your Wi-Fi network."}, {"title": "Enable MAC address filtering", "description": "Set up MAC address filtering on your router to only allow specific devices with approved MAC addresses to connect to your Wi-Fi network."}, {"title": "Hide your Wi-Fi network's SSID", "description": "Disable broadcasting your Wi-Fi network's SSID to make it less visible to potential attackers. However, note that this may not provide foolproof security."}, {"title": "Regularly check connected devices", "description": "Periodically review the list of devices connected to your Wi-Fi network to ensure that only trusted devices are authorized to access your network."}], "fields": {"basic": [{"name": "name"}, {"name": "password", "type": "password"}], "additional": [{"name": "url"}, {"name": "routerUsername", "label": "Router Username"}, {"name": "routerPassword", "label": "Router Password", "type": "password"}]}}}